{
    "non-swe-jobs": {
        "title": "Three CS Jobs that aren't Web Development",
        "date": "1-7-2024",

        "description": "Many computer science students aspire to become web developers down the line. In this article, I'll discuss some other CS-related career avenues that are worth exploring as well.",
        "content": "<p>If you're currently a college student majoring in computer science, this article is for you. These days, it feels like 99% of computer science majors in existence are looking to pursue a career in some form of web development (frontend, backend, full-stack). I'm not sure why this is the case or if it's always been this way, but I theorize that it may simply be due to a lack of exposure to other options. Don't get me wrong, there is nothing wrong with pursuing web development as a career - but exposure to other fields never hurts. In this article, I'll share what I know about three other CS career options and why I believe they're worth exploring.</p><i>Disclaimer: I'm not a professional with years of experience in any of these fields. I'm a college student, and this article is written based on my experience from various internships.</i><h2>Cloud Engineering</h2><p>Cloud engineers are primarily responsible for architecting, deploying, and maintaining services that live in clouds, such as AWS, Google Cloud, and Azure. They typically leverage infrastructure-as-code tools such as Terraform and Ansible to provision and configure cloud resources, and CI/CD tools such as Jenkins for build/deployment automation. In some scenarios, cloud engineers may also be responsible for implementing best security practices in cloud environments. Cloud engineering can be a good fit for anyone who enjoys crafting and overseeing big picture deployment environments.</p><h2>Site Reliability Engineering</h2><p>Site Reliability Engineers, or SREs, are responsible for ensuring that applications and services remain available. They achieve this by using software-driven automation and monitoring to replace common operations tasks, such as analyzing logs and applying security patches. SREs work closely with development teams to ensure that systems are reliable and that software can be deployed safely and without delay. Sometimes, SREs will even work directly on the software itself, which makes the role a good fit for software developers who are also knowledgable in operations-level tasks.</p><h2>Platform Engineering</h2><p>Platform Engineers make it possible for development teams to quickly deploy their software to multiple environments and easily configure CI/CD pipelines for their workloads. They accomplish this by building internal developer platforms (IDPs) that give development teams a comfortable level of abstraction from these processes while introducing organizational standards on how software is deployed. If you enjoy building software and want to improve the lives of developers around you, platform engineering may be a good fit for you.</p><h2>But what if I still prefer Web Development?</h2><p>Then stick to web development! The demand for web developers is still <a href=\"https://www.bls.gov/ooh/computer-and-information-technology/web-developers.htm\">growing at a rapid rate</a>, so as long as you put in the work, you'll likely be able to find a well-paying job.</p><p>That said, I still encourage anyone hoping to stick around in tech to do their own research into fields other than the one they're currently focused on. The tech industry and job market change rather often, so being knowledgable in multiple areas is never a bad idea. </p><h3>Sources</h3><ul><li><a href=\"https://www.redhat.com/en/topics/cloud\">Cloud Computing - Red Hat</a></li><li><a href=\"https://sre.google/\">Site Reliability Engineering - Google</a></li><li><a href=\"https://platformengineering.org/blog/what-is-platform-engineering\">What is Platform Engineering? - Platform Engineering Community</a></li></ul>"
    }
}